
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/personal_demos/week_7_terraform/runs/run-JkXsRZxz6kFqYniM

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.archive_file.zip2: Reading...
data.archive_file.zip1: Reading...
data.archive_file.zip2: Read complete after 0s [id=09a513526144a92c9ca50e66d634138a799bbf74]
data.archive_file.zip1: Read complete after 0s [id=edcd38b109b22030f1e2124a7f6e6de1faac9837]
aws_api_gateway_rest_api.apiLambda: Refreshing state... [id=nbmcei0lfk]
aws_dynamodb_table.dbtable: Refreshing state... [id=myTable]
aws_iam_role.writeRole: Refreshing state... [id=myWriteRole]
aws_iam_role.readRole: Refreshing state... [id=myReadRole]
aws_api_gateway_resource.readResource: Refreshing state... [id=yt1k8n]
aws_api_gateway_resource.writeResource: Refreshing state... [id=m46lj6]
aws_api_gateway_method.readMethod: Refreshing state... [id=agm-nbmcei0lfk-yt1k8n-POST]
aws_api_gateway_method.writeMethod: Refreshing state... [id=agm-nbmcei0lfk-m46lj6-POST]
aws_iam_role_policy.read_policy: Refreshing state... [id=myReadRole:lambda_read_policy]
aws_lambda_function.readLambda: Refreshing state... [id=readLambda]
aws_iam_role_policy.write_policy: Refreshing state... [id=myWriteRole:lambda_write_policy]
aws_lambda_function.writeLambda: Refreshing state... [id=writeLambda]
aws_api_gateway_integration.readInt: Refreshing state... [id=agi-nbmcei0lfk-yt1k8n-POST]
aws_lambda_permission.readPermission: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_permission.writePermission: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.writeInt: Refreshing state... [id=agi-nbmcei0lfk-m46lj6-POST]
aws_api_gateway_deployment.apideploy: Refreshing state... [id=n79dxn]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_integration.integration_request_opt will be created
  + resource "aws_api_gateway_integration" "integration_request_opt" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "OPTIONS"
      + id                      = (known after apply)
      + integration_http_method = "OPTIONS"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "m46lj6"
      + rest_api_id             = "nbmcei0lfk"
      + timeout_milliseconds    = 29000
      + type                    = "MOCK"
    }

  # aws_api_gateway_integration_response.integration_response_opt_200 will be created
  + resource "aws_api_gateway_integration_response" "integration_response_opt_200" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = "m46lj6"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,GET,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "nbmcei0lfk"
      + status_code         = "200"
    }

  # aws_api_gateway_integration_response.read_integration_response will be created
  + resource "aws_api_gateway_integration_response" "read_integration_response" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "yt1k8n"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = "'*'"
        }
      + rest_api_id         = "nbmcei0lfk"
      + status_code         = "200"
    }

  # aws_api_gateway_integration_response.write_integration_response will be created
  + resource "aws_api_gateway_integration_response" "write_integration_response" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "m46lj6"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = "'*'"
        }
      + rest_api_id         = "nbmcei0lfk"
      + status_code         = "200"
    }

  # aws_api_gateway_method.my_api_method_opt_write will be created
  + resource "aws_api_gateway_method" "my_api_method_opt_write" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = "yt1k8n"
      + rest_api_id      = "nbmcei0lfk"
    }

  # aws_api_gateway_method_response.method_response_opt_200 will be created
  + resource "aws_api_gateway_method_response" "method_response_opt_200" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = "m46lj6"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "nbmcei0lfk"
      + status_code         = "200"
    }

  # aws_api_gateway_method_response.read_http_status_value will be created
  + resource "aws_api_gateway_method_response" "read_http_status_value" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "yt1k8n"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "nbmcei0lfk"
      + status_code         = "200"
    }

  # aws_api_gateway_method_response.write_http_status_value will be created
  + resource "aws_api_gateway_method_response" "write_http_status_value" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "m46lj6"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "nbmcei0lfk"
      + status_code         = "200"
    }

Plan: 8 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @SalvadorM271, Action: `pull_request`*